				Notes

* VVIP How I'm gonna avoid the mistakes I made during the CPS assignment
** Write honest unit test for each feature I add 
** Have absolutely NO global variables
** VVIP Refactor after every git commit. Let's do it right this time.
** Take breaks when Workrave tells me to
* Theory - 0-CFA (Control Flow Analysis)
** Flow-insensitive context-insensitive flow analysis
** For EACH expression e, there is a flow variable [e]
** Assumption: All program variable names and argument names are unique
** Generate constraints
*** Types of constraints
**** c \in X - Beginning
**** X \sube Y - Propagation
**** c \in X => Y \sube Z - conditional
*** Rules
**** Beginning
***** "this" in class C
****** C \in [this-C]
***** new C()
****** C \in [new C()]
**** Propagation
***** id = expression
****** [expression] \sube [id]
**** Conditional
***** method call: exp.method(exp1, exp2, ...) where method in class C is like "(param1, param2, ...) { ... return exp0;}"
****** C \in [exp] => [exp1] \sube [param1]
****** C \in [exp] => [exp0] \sube [exp.method(exp1, exp2, ...)]
** Solve constraints = Computing Flow Sets
*** U - Maximal set of classes
*** [e] \in P(U)
*** DONE What is a Lattice? Poset which has a supremum (least upper bound) and an infinum (greatest lower bound)
*** Property of Conservative Flow Analysis
**** Minimal solution is above the optimal information
** Constraint Solver
*** At any point in time it maintains the minimal solution
*** Constraints are represented as a graph (N, E)
**** N: Set of flow variables
**** VVIP E: (v -> w \in E) => v \sube w
*** Value of a flow variable X is stored in a bit vector B(X)
*** Each bit i has an associated set of pending constraints corresponding to the conditional constraints - K(X, i)
**** e.g., C \in X => Y \sube Z: Y \sube Z \in K(X, i) where i corresponds to C
** TODO Algorithm
*** Propagate (v: flow variable, i: class)
**** if i is already in v, no need to do anything
**** Beginning: put i in v
**** Propagation: if v -> w, then we know v \sube w, so propagate i to w as well
**** Conditional: insert all the consequents of conditionals with (i \in v)
*** Insert (i \in X)
**** simply Propagate (i \in X)
*** Insert (X \sube Y)
**** VVIP Insert an edge X -> Y
***** I think this is more than necessary. You only ever use this information to infer that X \sube Y, so you could as well have stored just that much.
**** for each class i in X, Propagate (Y, i)
*** Insert (c \in X => Y \sube Z)
**** If the antecedent is true, then Insert(Y \sube Z)
**** Else, Add the consequent to K(X, i) where i corresponds to c
** Code duplication
*** Polymorphic function - Method Duplication
*** Polymorphic data item - Class Duplication
** For each expression e, there is a flow variable [e]
* Design
** Constraint
*** Beginning Constraint
*** Propagation Constraint
*** Conditional Constraint
** Variable Name Uniquifier: Microjava -> Microjava with unique identifier names
*** Use a hash table with a counter for each distinct identifier
** Collect Flow Variables: Microjava (with unique identifier names) -> [X]
** TODO Collect Class names: Microjava (with unique identifier names) -> [C]
*** Note: Also collect the basic types like int, boolean, etc.
** Constraint Generator: Microjava, Flow Variables, Class Names -> {Beginning Constraint}, {Propagation Constraint}, {Conditional Constraint}
** Constraint Solver: [Constraints, _ , _ ], Flow Variables, Class Names -> {Flow variable: Flow Set}
** TODO Polymorphic Method Handler
** TODO Polymorphic Class Handler
** Code Optimizer: Final Microjava code, {Flow variable: Flow Set} -> Microjava with Inlined Methods
** Method Inliner: Method Declaration * Method Invocation -> Variable Declarations, Statement List, Return Value Variable
* Plan
** DONE Set up the basic files
   CLOCK: [2013-04-05 Fri 20:45]--[2013-04-05 Fri 20:52] =>  0:07
** DONE Note down basic theory
   CLOCK: [2013-04-06 Sat 00:02]--[2013-04-06 Sat 00:38] =>  0:36
   CLOCK: [2013-04-05 Fri 20:53]--[2013-04-05 Fri 21:27] =>  0:34
** DONE Hand-simulate example 2
   CLOCK: [2013-04-06 Sat 00:39]--[2013-04-06 Sat 01:33] =>  0:54
** DONE Flesh out the Design
   CLOCK: [2013-04-06 Sat 10:09]--[2013-04-06 Sat 10:31] =>  0:22
   CLOCK: [2013-04-06 Sat 09:43]--[2013-04-06 Sat 09:50] =>  0:07
** DONE InlinerHelper
   CLOCK: [2013-04-06 Sat 10:31]--[2013-04-06 Sat 10:48] =>  0:17
** DONE Refactor
   CLOCK: [2013-04-06 Sat 11:14]--[2013-04-06 Sat 11:14] =>  0:00
   CLOCK: [2013-04-06 Sat 11:11]--[2013-04-06 Sat 11:12] =>  0:01
   CLOCK: [2013-04-06 Sat 10:51]--[2013-04-06 Sat 11:11] =>  0:20
** DONE IdentityVisitor
   CLOCK: [2013-04-06 Sat 16:41]--[2013-04-06 Sat 16:45] =>  0:04
   CLOCK: [2013-04-06 Sat 12:43]--[2013-04-06 Sat 13:29] =>  0:46
   CLOCK: [2013-04-06 Sat 12:10]--[2013-04-06 Sat 12:20] =>  0:10
** DONE Put them all under inliner package
   CLOCK: [2013-04-06 Sat 12:20]--[2013-04-06 Sat 12:42] =>  0:22

** TODO Variable Name Uniquifier
   CLOCK: [2013-04-06 Sat 16:45]--[2013-04-06 Sat 16:56] =>  0:11
   CLOCK: [2013-04-06 Sat 11:56]--[2013-04-06 Sat 12:10] =>  0:14
   CLOCK: [2013-04-06 Sat 11:50]--[2013-04-06 Sat 11:51] =>  0:01
*** Note that Class + Method + variable name is unique
*** Note that foo(int x) { Type x; } is not valid
*** So, maybe just have a class called FlowVar which has class, method, and name fields
** FlowVariableCollector
   CLOCK: [2013-04-09 Tue 00:55]--[2013-04-09 Tue 00:55] =>  0:00
   CLOCK: [2013-04-09 Tue 00:36]--[2013-04-09 Tue 00:54] =>  0:18
*** I think I can collect all the variables trivially after the Constraint Generation step
** DONE Add my customized TreeFormatter
   CLOCK: [2013-04-09 Tue 00:57]--[2013-04-09 Tue 01:04] =>  0:07

** DONE Constraint Class
   CLOCK: [2013-04-09 Tue 01:26]--[2013-04-09 Tue 01:51] =>  0:25
** DONE ConstraintGenerator
*** DONE Beginning Constraints
    CLOCK: [2013-04-09 Tue 01:51]--[2013-04-09 Tue 02:22] =>  0:31
    CLOCK: [2013-04-09 Tue 01:22]--[2013-04-09 Tue 01:26] =>  0:04
*** DONE Propagation constraints
    CLOCK: [2013-04-09 Tue 02:35]--[2013-04-09 Tue 02:50] =>  0:15
    CLOCK: [2013-04-09 Tue 02:22]--[2013-04-09 Tue 02:25] =>  0:03
**** Assuming that foo.bar identifier within a method is still a FlowVar <Class, Method, "foo.bar"> not <Foo, null, "bar">
*** DONE Conditional constraints
    CLOCK: [2013-04-09 Tue 02:50]--[2013-04-09 Tue 02:53] =>  0:03
**** Get all classes which have a method with that name and that many number of arguments
***** DONE What if it has multiple methods with the same name?
****** Boy am I glad that I used a separate visitor for generating conditional constraints. Made it effortless.
**** Extract the matching method(s??)
**** DONE Generate constraints
     CLOCK: [2013-04-10 Wed 19:58]--[2013-04-10 Wed 20:22] =>  0:24
**** DONE Conditional Constraint Visitor
     CLOCK: [2013-04-10 Wed 18:57]--[2013-04-10 Wed 19:58] =>  1:01
     :PROPERTIES:
     :Effort:   10
     :END:
** TODO I think I SHOULD uniquify the names cos now I can't blindly create FlowVar using the currClassName and currMethodName.
** DONE Refactor
   CLOCK: [2013-04-10 Wed 23:59]--[2013-04-11 Thu 00:33] =>  0:34
*** DONE Check if I have Java 7 (I do... I knooooow!... WAIT! Turns out I don't!)
*** DONE Check out whether Java 7 has an equivalent of map (Nope, it doesn't)
** Constraint Solver
*** Fields
    CLOCK: [2013-04-10 Wed 23:55]--[2013-04-10 Wed 23:59] =>  0:04
    :PROPERTIES:
    :Effort:   10
    :END:
**** DONE Constructor
     CLOCK: [2013-04-11 Thu 00:43]--[2013-04-11 Thu 00:48] =>  0:05
**** DONE arrays
     CLOCK: [2013-04-11 Thu 00:48]--[2013-04-11 Thu 01:15] =>  0:27
*** DONE Test getClassNames
    CLOCK: [2013-04-11 Thu 01:21]--[2013-04-11 Thu 01:47] =>  0:26
** DONE Try moving all allocations out of setUp and see if it speeds up Unit tests (and preserves correctness)
   CLOCK: [2013-04-11 Thu 01:17]--[2013-04-11 Thu 01:21] =>  0:04
*** Before
**** 0.158
**** 0.165
*** After
**** 0.177
**** 0.159
*** Nope. Not a huge difference.
